ERP.belugaerp/src/Documents/АктПостановкиНаБалансЕГАИС/АктПостановкиНаБалансЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АктПостановкиНаБалансЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаПостановкиНаБаланс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоПоСправке1</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТТН</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаТТН</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПодтвержденияЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПодтвержденияЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/AccumulationRegisters/ОстаткиАлкогольнойПродукцииЕГАИС/ОстаткиАлкогольнойПродукцииЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОстаткиАлкогольнойПродукцииЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СвободныйОстаток</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ОрганизацияЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Справка2</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДокументовЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>бг_АктОбУничтоженииФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ДобавлениеНовойПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияАктаОбУничтожении</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОбИмпорте</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияПланируемогоВвоза</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗаявлениеОВыдачеФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_КвитанцияОтчетОбИспользованииФСМ</name>
    <comment>ReportUsingFSM</comment>
  </enumValues>
  <enumValues>
    <name>бг_НакладнаяНаВыдачуФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтветНаЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОбИмпортеПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОПроизводствеЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ПланируемыйВвозЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсторияСправок2ПоТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияВходящейТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/АктПостановкиНаБалансЕГАИС/ObjectModule.bsl
#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура бг_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
#Удаление
	АкцизныеМаркиЕГАИС.ПроверитьЗаполнениеАкцизныхМарок(ЭтотОбъект, Отказ);
#КонецУдаления
	
	Если ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр3 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПричинаПостановкиНаБаланс");
	КонецЕсли;
	
	Если ПричинаПостановкиНаБаланс <> Перечисления.ПричиныПостановкиНаБалансЕГАИС.Пересортица Тогда
		МассивНепроверяемыхРеквизитов.Добавить("АктСписанияЕГАИС");
	КонецЕсли;
	
	Если ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр2
		Или ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр3 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоПоСправке1");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.НомерТТН");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаТТН");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаРозлива");
	КонецЕсли;
	
	Если ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр1
		Или ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр2 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Справка2");
	КонецЕсли;
	
	ИнтеграцияЕГАИСПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	бг_ИнициализироватьДополнительныеСвойства();
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура бг_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ИнтеграцияИС.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.АктПостановкиНаБалансЕГАИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ИнтеграцияИС.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияИСПереопределяемый.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
	
#Вставка
	// Снимаем флаги автоматической записи, чтобы вызываемый ниже метод ИнтеграцияИС.ЗаписатьНаборыЗаписей()
	// не вызывал дополнительную запись пустых наборов регистра марок, которые лишний раз будут выгружаться в WMS.
	Движения.бг_ДвижениеМарок.Записывать = Ложь;
#КонецВставки
	
	ИнтеграцияИС.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ИнтеграцияЕГАИСПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ИнтеграцияИС.ОчиститьДополнительныеСвойстваДляПроведения(ЭтотОбъект.ДополнительныеСвойства);
	
#Вставка
	МенеджерДокумента = Документы.АктПостановкиНаБалансЕГАИС;
	Если МенеджерДокумента.бг_СтатусЯвляетсяПодтвержденным(ДополнительныеСвойства.бг_ТекущийСтатус) Тогда
		МенеджерДокумента.бг_АктуализироватьСерииСправки(Ссылка);
	КонецЕсли;
	бг_СформироватьДвиженияПоМаркам(Отказ);
#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ИнициализироватьДополнительныеСвойства()
	
	// бг_ТекущийСтатус
	ТекущийСтатус = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Ссылка).Статус;
	ДополнительныеСвойства.Вставить("бг_ТекущийСтатус", ТекущийСтатус);
	
	// бг_ФормироватьДвиженияПоМаркам
	ФормироватьДвиженияПоМаркам = бг_ИнтеграцияЕГАИСПовтИсп.ИспользоватьМеханизмДвиженийМарок(Ссылка);
	ДополнительныеСвойства.Вставить("бг_ФормироватьДвиженияПоМаркам", ФормироватьДвиженияПоМаркам);
	
	// бг_ЭтоКонтролерЕГАИС
	ДополнительныеСвойства.Вставить("бг_ЭтоКонтролерЕГАИС", Пользователи.РолиДоступны("бг_КонтролерЕГАИС"));
	
КонецПроцедуры

#Область ДвиженияПоМаркам

Процедура бг_СформироватьДвиженияПоМаркам(Отказ)
	
	Если Отказ Или Не ДополнительныеСвойства.бг_ФормироватьДвиженияПоМаркам Тогда
		Возврат;
	КонецЕсли;
	
	Если Документы.АктПостановкиНаБалансЕГАИС.бг_СтатусЯвляетсяПодтвержденным(ДополнительныеСвойства.бг_ТекущийСтатус) Тогда
		
		ДанныеПриходуемыхШтрихкодов = Документы.АктПостановкиНаБалансЕГАИС.бг_ДанныеПриходуемыхШтрихкодов(
			Ссылка,
			Ложь);
			
		бг_ПроверитьСоответствиеМарокТоварам(Отказ, ДанныеПриходуемыхШтрихкодов);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		бг_ОтразитьДвиженияМарок(ДанныеПриходуемыхШтрихкодов.Марки);
		
	Иначе
		
		Движения.бг_ДвижениеМарок.Очистить();
		Движения.бг_ДвижениеМарок.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура бг_ПроверитьСоответствиеМарокТоварам(Отказ, ДанныеПриходуемыхШтрихкодов)
	
	Если ДанныеПриходуемыхШтрихкодов = Неопределено Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не найдены данные списываемых марок, проведение невозможно.'"),
			Ссылка,,,
			Отказ);
			
		Возврат;
	КонецЕсли;
	
	Документы.АктПостановкиНаБалансЕГАИС.бг_МаркиСоответствуютАлкогольнойПродукцииАкта(
		ДанныеПриходуемыхШтрихкодов.Марки,
		Ссылка,
		Отказ);
		
КонецПроцедуры

Процедура бг_ОтразитьДвиженияМарок(Марки)
	
	СтатусыМарокПоОперации = Перечисления.бг_СтатусыАкцизныхМарок.СтатусыПоОперации(Метаданные().Имя);
	СтатусМаркиСтатусНаБалансе = СтатусыМарокПоОперации.СтатусНаБалансе;
	
	ДатаДвиженияМарок = Документы.АктПостановкиНаБалансЕГАИС.бг_ДатаДвиженияМарок(
		Ссылка,
		Дата,
		ДатаРегистрацииДвижений);
	
	Для каждого СтрокаМарки Из Марки Цикл
		Запись = Движения.бг_ДвижениеМарок.Добавить();
		Запись.Период = ДатаДвиженияМарок;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаМарки);
		Запись.СтатусМарки = СтатусМаркиСтатусНаБалансе;
	КонецЦикла;
	
	Движения.бг_ДвижениеМарок.Записать();
	
КонецПроцедуры

#КонецОбласти // Конец ДвиженияПоМаркам

#КонецОбласти
